Repository: flavor-receitinhas/receitinhas_app
Catalog: lib/src/core/l10n/app_*.arb
Languages: pt_br

# welcomeTitle
source: Delight yourself with our amazing culinary masterpieces!
pt_br: Encante-se com nossas obras culinárias incríveis!

source: Language
pt_br: Idioma

# languageChangeSuccess
source: Language changed successfully
pt_br: Idioma alterado com sucesso

source: Change Language
pt_br: Mudar idioma

# languageEnglish
source: English
pt_br: Inglês

# languageSpanish
source: Spanish
pt_br: Espanhol

# welcomeBody
source: Awaken your passion for cooking and explore a world of unforgettable flavors with inspiring recipes.
pt_br: Desperte sua paixão pela culinária e explore um mundo de sabores inesquecíveis com receitas inspiradoras.

# welcomeBottomAppBar
source: Start Cooking
pt_br: Começar a Cozinhar

# chooseAuthTitle
source: Before starting, we have a question.
pt_br: Antes de começar, queremos tirar uma dúvida.

# chooseAuthBody
source: Are you a new culinary lover or do you already have an account with us?
pt_br: Você é um novo amante da culinária ou já tem uma conta por aqui?

# chooseAuthRegisterButton
source: I'm new here
pt_br: Sou novo(a) aqui

# chooseAuthLoginButton
source: I already have an account
pt_br: Já tenho uma conta

# registerTitle
source: Nothing better than becoming a Master of Culinary Arts!
pt_br: Nada melhor que se tornar um Mestre da Culinária!

# registerEmail
source: Enter email
pt_br: Inserir e-mail

# registerPassword
source: Enter password
pt_br: Inserir senha

# registerTerms1
source: By creating an account, you agree to the
pt_br: Ao criar a conta, você concorda com os

# registerTerms2
source: Terms of Use
pt_br: Termos de Uso

# registerTerms3
source: and
pt_br: e

# registerTerms4
source: Privacy Policy.
pt_br: Política de Privacidade.

# registerButton
source: Create account
pt_br: Criar conta

# registerValidatorEmail
source: Enter a valid email
pt_br: Digite um email válido

# registerValidatorPassword1
source: Password is required
pt_br: Senha é obrigatória

# registerValidatorPassword2
source: Password must be at least 8 characters
pt_br: A senha deve conter pelo menos 8 caracteres

# registerValidatorPassword3
source: Password must contain at least one uppercase letter
pt_br: A senha deve conter pelo menos uma letra maiúscula

# registerValidatorPassword4
source: Password must contain at least one lowercase letter
pt_br: A senha deve conter pelo menos uma letra minúscula

# registerValidatorPassword5
source: Password must contain at least one number
pt_br: A senha deve conter pelo menos um número

# loginTitle
source: We're happy to have you back!
pt_br: Ora Ora... Se não é a grande lenda voltando...

# loginBody
source: Ready to create new recipes?
pt_br: Estavamos com saudades :)

# loginEmail
source: Enter email
pt_br: Inserir e-mail

# loginPassword
source: Enter password
pt_br: Inserir senha

# loginForgetPassword
source: Forgot password?
pt_br: Esqueceu a senha?

# loginButton
source: Login
pt_br: Entrar

# forgetPasswordTitle
source: Forgot your password?
pt_br: Esqueceu sua senha?

# forgetPasswordBody
source: No problem!
pt_br: Sem problemas!

# forgetPasswordHintFild
source: Enter email
pt_br: Inserir e-mail

# forgetPasswordButton
source: Send recovery link
pt_br: Enviar link de recuperação

# forgetPasswordValidatorEmail
source: Enter a valid email
pt_br: Digite um email válido

# forgetPasswordTextSnack
source: Sent to your email
pt_br: Enviado para o seu email

# forgetPasswordOptionSnack
source: Back
pt_br: Voltar

# proteinPreferenceTitle
source: Do you have any Protein Preference?
pt_br: Tem alguma Preferência de Proteína?

# proteinPreferenceOptions
source: {choice, select, vegetarian{Vegetarian} vegan{Vegan} meat{Meat} fish{Fish} other{Error}}
pt_br: {choice, select, vegetarian{Vegetariano} vegan{Vegano} meat{Carne} fish{Peixe} other{Erro}}

# proteinPreferenceConfirm
source: Next step
pt_br: Próxima etapa

# proteinPreferenceSnackBar
source: Select an option
pt_br: Selecione uma opção

# dietaryRestrictionTitle
source: Do you have any Dietary Restrictions?
pt_br: Possui alguma Restrição Alimentar?

# dietaryRestrictionOptions
source: {choice, select, gluten{Gluten} lactose{Lactose} noRestriction{No restriction} other{Error}}
pt_br: {choice, select, gluten{Glúten} lactose{Lactose} noRestriction{Nenhuma restrição} other{Erro}}

# dietaryRestrictionConfirm
source: Next step
pt_br: Próxima etapa

# dietaryRestrictionSnackBar
source: Select an option
pt_br: Selecione uma opção

# difficultyRecipesTitle
source: Desired difficulty level:
pt_br: Nivel de dificuldade desejado:

# difficultyRecipesOptions
source: {choice, select, easy{Easy and quick} medium{Moderate or casual} hard{Challenging, a nightmare} other{Error}}
pt_br: {choice, select, easy{Fácil e rápido} medium{Moderado, ou casual} hard{Desafiador, um pesadelo} other{Erro}}

# difficultyRecipesConfirm
source: Next step
pt_br: Próxima etapa

# difficultyRecipesSnackBar
source: Select an option
pt_br: Selecione uma opção

# chooseNameTitle
source: A chef must have a memorable name!
pt_br: Um chefe deve ter um nome memóravel!

# chooseNameBody
source: What can we call you?
pt_br: Como podemos te chamar ?

# chooseNameHintText
source: Write your name...
pt_br: Escreva seu nome...

# chooseNameConfirm
source: Next step
pt_br: Próxima etapa

# configSettings
source: Settings
pt_br: Configurações

# configCustomizePreference
source: Customize according to your preference
pt_br: Personalize conforme sua preferência

# configLogoutPrompt
source: Do you really want to log out of your account?
pt_br: Deseja realmente sair da sua conta?

# configLogoutReminder
source: Remember that by logging out, you can access it again using your credentials.
pt_br: Lembrando que ao sair da sua conta, poderá acessar ela novamente usando suas credenciais.

# configDontLogout
source: I don't want to log out
pt_br: Não desejo sair da conta

# configLogout
source: Log out
pt_br: Sair da conta

# configAboutOurTeam
source: Our team
pt_br: Nossa equipe

# configAboutTeamDescription
source: Our Team Welcome to the dedicated team behind Flavor. We are excited to introduce the creative minds who work tirelessly to make your experience even better. We are committed to creating an app that meets your needs and expectations. Thank you for being part of our journey, and we hope to continue improving and innovating to offer you the best possible experience.
pt_br: Nossa Equipe Bem-vindo à equipe dedicada por trás do Flavor. Estamos entusiasmados em apresentar as mentes criativas que trabalham incansavelmente para tornar a sua experiência ainda melhor. Estamos comprometidos em criar um aplicativo que atenda às suas necessidades e expectativas. Agradecemos por fazer parte da nossa jornada e esperamos continuar aprimorando e inovando para oferecer a você a melhor experiência possível.

# configChangePassword
source: Change password
pt_br: Alterar senha

# configOldPassword
source: Old password
pt_br: Senha antiga

# configOldPasswordHint
source: Write your old password
pt_br: Escreva sua senha antiga

# configNewPassword
source: New password
pt_br: Nova senha

# configNewPasswordHint
source: Enter your new password
pt_br: Digite sua nova senha

# configConfirmNewPassword
source: Confirm new password
pt_br: Confirme a nova senha

# configConfirmNewPasswordHint
source: Confirm your new password
pt_br: Confirme sua nova senha

# configPasswordChangeNotification
source: You will be notified in your email inbox about the password change.
pt_br: Você será notificado na sua caixa de emails sobre a mudança de senha.

# configAccount
source: Account
pt_br: Conta

# configEditAccount
source: Edit Preferences
pt_br: Editar Conta

# configCustomization
source: Customization
pt_br: Personalização

# configNightMode
source: Night mode
pt_br: Modo noturno

# configPrivacyPolicy
source: Privacy Policy
pt_br: Políticas de privacidade

# configTermsConditions
source: Terms and conditions
pt_br: Termos e condições

# configOurTeam
source: Our team
pt_br: Nossa equipe

# configAppVersion
source: App Version
pt_br: Versão do Aplicativo

# configName
source: Name
pt_br: Nome

# configNameHint
source: Write your name...
pt_br: Escreva seu nome...

# configFoodPreference
source: Food preference
pt_br: Preferência alimentar

# configDietaryRestriction
source: Dietary restriction
pt_br: Restrição alimentar

# favoriteOrganizeRecipesTitle
source: Organize by
pt_br: Organizar por

# favoriteOrganizeRecipesRecentFirst
source: Most recent first
pt_br: Mais recente primeiro

# favoriteOrganizeRecipesOldestFirst
source: Oldest first
pt_br: Mais antigo primeiro

# favoriteOrganizeRecipesNameAsc
source: Name A to Z
pt_br: Nome de A a Z

# favoriteOrganizeRecipesNameDesc
source: Name Z to A
pt_br: Nome de Z a A

# favoritePageTitle
source: Favorites List
pt_br: Lista de Favoritos

# favoritePageSubtitle
source: Manage your favorite recipes
pt_br: Gerencie suas receitas favoritas

# favoritePageSearchHint
source: Search your favorite recipe
pt_br: Pesquise sua receita favorita

# favoritePageErrorLoading
source: Error loading recipes
pt_br: Erro ao carregar receitas

# favoritePageNoItemsFound
source: No recipes found
pt_br: Nenhuma receita encontrada

# favoriteRemoveFavoritesTitle
source: Remove from favorites
pt_br: Remover dos favoritos

# favoriteRemoveFavoritesContent
source: Do you really want to remove this recipe from favorites?
pt_br: Deseja realmente remover essa receita dos favoritos?

# customBottomBarExitAppTitle
source: Do you want to exit the app?
pt_br: Deseja sair do app?

# customBottomBarCancel
source: Cancel
pt_br: Cancelar

# customBottomBarExit
source: Exit
pt_br: Sair

# homePageGreeting
source: Hello
pt_br: Olá

# homePageSubtitle
source: What are we cooking today?
pt_br: O que vamos cozinhar hoje?

# homePageSearchHint
source: Search for something to cook
pt_br: Procure algo para cozinhar

# homePageLatestRecipesTitle
source: Latest posted recipes
pt_br: Últimas receitas postadas

# profileBackSheetConfirmExit
source: Are you sure you want to exit without saving changes?
pt_br: Você tem certeza que deseja sair sem salvar as alterações?

# profileBackSheetExitWithoutSaving
source: Exit without saving
pt_br: Sair sem salvar

# profileBackSheetContinueEditing
source: Continue editing
pt_br: Continuar editando

# profileSaveSheetConfirmMessage
source: Make sure you are certain, so we can show the world your new profile!
pt_br: Verifique bem se tem certeza, assim podemos mostrar ao mundo o seu novo perfil!

# profileSaveSheetSaveChanges
source: Save changes
pt_br: Salvar alterações

# profileSaveSheetContinueEditing
source: Continue editing
pt_br: Continuar editando

# profileEditProfilePageSaveChanges
source: Do you want to save the changes?
pt_br: Deseja salvar as alterações?

# profileEditProfilePageTitle
source: Your profile
pt_br: Seu perfil

# profileEditProfilePageSubtitle
source: Here are your published recipes
pt_br: Aqui fica suas receitas publicadas

# profileEditProfilePageBack
source: Back
pt_br: Voltar

# profileEditProfilePageConfirmExit
source: Do you want to discard the changes?
pt_br: Você deseja descartar as alterações?

# profileEditProfilePageChangeProfilePicture
source: Change avatar
pt_br: Alterar avatar

# profileEditProfilePageRemoveProfilePicture
source: Remove Image
pt_br: Remover Imagem

# profileEditProfilePageImageRequirement
source: The image must be at least 256x256px
pt_br: A imagem tem que ter no minimo 256x256px

# profileEditProfilePageTitleLabel
source: Title
pt_br: Título

# profileEditProfilePageTitleHint
source: Select a title
pt_br: Selecione um título

# profileEditProfilePageTitleDescription
source: Select a title with which you most identify
pt_br: Selecione um título na qual você mais se indentifica

# profileEditProfilePageAboutMe
source: About me
pt_br: Sobre mim

# profileEditProfilePageAboutMeHint
source: Tell us a bit about yourself...
pt_br: Fale um pouco sobre você...

# profileEditProfilePagePrivacy
source: Privacy
pt_br: Privacidade

# profileEditProfilePageHideFollowers
source: Hide followers
pt_br: Ocultar seguidores

# profileEditProfilePageHideLikes
source: Hide likes
pt_br: Ocultar likes

# profileMyProfilePageTitle
source: Your profile
pt_br: Seu perfil

# profileMyProfilePageSubtitle
source: Here are your published recipes
pt_br: Aqui fica suas receitas publicadas

# profileMyProfilePageBack
source: Back
pt_br: Voltar

# profileMyProfilePageEditProfile
source: Edit profile
pt_br: Editar perfil

# profileMyProfilePageSearchHint
source: Find a recipe
pt_br: Pesquise sua receita favorita

# profileMyProfilePageNoRecipes
source: You don't have any published recipes yet...
pt_br: Você ainda não tem receitas publicadas...

# profileViewProfilePageTitle
source: Explore Profile
pt_br: Explorar Perfil

# profileViewProfilePageSubtitle
source: Discover this user's culinary creations
pt_br: Descubra as criações culinárias deste usuário

# profileViewProfilePageBack
source: Back
pt_br: Voltar

# profileViewProfilePageNoRecipes
source: This chef doesn't have any published recipes...
pt_br: Esse chefe não tem receitas publicadas...

# recipeLeaveRecipeSheetDiscardWarning
source: By discarding, we cannot recover what was written in your recipe.
pt_br: Ao descartar, não podemos recuperar o que foi escrito na sua receita.

# recipeLeaveRecipeSheetContinueWriting
source: Continue writing
pt_br: Continuar escrevendo

# recipeLeaveRecipeSheetDiscardRecipe
source: Discard recipe
pt_br: Descartar receita

# recipeWriteTimePreparedMinutes
source: Minutes
pt_br: Minutos

# recipeWriteTimePreparedHours
source: Hours
pt_br: Horas

# recipeCarouselSelectImagesRecipeMaxImages
source: Only 10 images are allowed per recipe
pt_br: Só é permitido 10 imagens por receita

# recipeCreateBackEndSafeButtonPublishPrompt
source: Do you want to publish your recipe?
pt_br: Deseja públicar sua receita?

# recipeCreateBackEndSafeButtonPublishConfirmation
source: Make sure you are certain, so we can show the world your beautiful recipe!
pt_br: Verifique bem se tem certeza, assim podemos mostrar ao mundo sua linda receita!

# recipeCreateBackEndSafeButtonPublish
source: Publish recipe
pt_br: Publicar receita

# recipeCreateBackEndSafeButtonSaveDraft
source: Save recipe as draft
pt_br: Salvar receita como rascunho

# recipeCreateBackEndSafeButtonContinueWriting
source: Continue writing
pt_br: Continuar escrevendo

# recipeCreateBackEndSafeButtonSave
source: Save
pt_br: Salvar

# recipeDifficultyTitle
source: Difficulty
pt_br: Dificuldade

# recipeDifficultyBack
source: Back
pt_br: Voltar

# recipeDifficultyNext
source: Next
pt_br: Próximo

# recipePortionSnackBarMessage
source: Indicate how many servings your recipe can serve
pt_br: Informe quantas porções sua receita pode servir

# recipePortionTitle
source: Servings
pt_br: Porções

# recipePortionQuestion
source: How many servings can your recipe serve?
pt_br: Quantas porções sua receita pode servir?

# recipeTimePreparedTitle
source: Preparation time
pt_br: Tempo de preparo

# recipeTimePreparedSnackBarMessage
source: Indicate the preparation time
pt_br: Informe o tempo de preparo

# recipeSelectIngredientHint
source: Choose the unit
pt_br: Escolha a unidade

# recipeSelectIngredientRequiredFields
source: Required fields
pt_br: Campos obrigatórios

# recipeSelectIngredientConfirm
source: Confirm
pt_br: Confirmar

# recipeDetailsTitle
source: Recipe details
pt_br: Detalhes da receita

# recipeIngredientsTitle
source: Ingredients
pt_br: Ingredientes

# recipeInstructionsTitle
source: Preparation instructions
pt_br: Instruções de preparo

# recipeServeFoodTitle
source: Time to serve!
pt_br: Hora de se servir!

# recipeIntroducePortionSingular
source: serving
pt_br: porção

# recipeIntroducePortionPlural
source: servings
pt_br: porções

# recipeLoadIngredientsError
source: Error loading ingredients
pt_br: Erro ao carregar ingredientes

# recipeNoItemsFound
source: No ingredient found
pt_br: Nenhum ingrediente encontrado

# recipeAddIngredient
source: Add ingredient
pt_br: Adicionar ingrediente

# recipeIngredientNotFound
source: Didn't find your ingredient?
pt_br: Não encontrou seu ingrediente?

# recipeEnterIngredientBelow
source: Enter it in the field below
pt_br: Digite ele no campo abaixo

# recipeEnterIngredientHint
source: Enter the ingredient
pt_br: Digite o ingrediente

# recipeConfirm
source: Confirm
pt_br: Confirmar

# recipeSelectQuantity
source: Select quantity
pt_br: Selecionar quantidade

# recipeSelectedIngredients
source: Selected ingredients
pt_br: Ingredientes selecionados

# recipeCustomizeBasicInfoTitle
source: Customize basic information
pt_br: Personalize informações básicas

# recipeCustomizeBasicInfoDescription
source: This information will help identify basic things about your recipe, so be concise.
pt_br: Essas informações vão ajudar a indentificar coisas básicas da sua receita, então seja bem consiso.

# recipePortions
source: servings
pt_br: porções

# recipeBasicInfoDescription
source: This information will help identify basic things about your recipe, so be concise.
pt_br: Essas informações vão ajudar a indentificar coisas básicas da sua receita, então seja bem consiso.

# recipeAddAtLeastOneIngredient
source: Add at least one ingredient
pt_br: Adicione pelo menos um ingrediente

# recipeAddImage
source: Add an image of the recipe
pt_br: Adicione uma imagem da receita

# recipeAddCoverImage
source: Add a cover image
pt_br: Adicione uma imagem de capa

# recipeFillAllFields
source: Fill in all fields correctly
pt_br: Preencha todos os campos corretamente

# recipeDiscardPrompt
source: Do you want to discard your recipe?
pt_br: Deseja descartar sua receita?

# recipePhotosTitle
source: Recipe photos
pt_br: Fotos da receita

# recipeCoverTitle
source: Recipe cover
pt_br: Capa da receita

# recipeTitleHint
source: Recipe title
pt_br: Titulo da receita

# recipeTitleValidation
source: Write a title with at least 3 letters
pt_br: Escreva um titulo com no mínimo 3 letras

# recipeSubtitleHint
source: Recipe subtitle
pt_br: Subtitulo da receita

# recipeAboutTitle
source: About the recipe
pt_br: Sobre a receita

# recipeAboutHint
source: Tell us a bit about your recipe here...
pt_br: Fale um pouco da sua receita aqui...

# recipeAboutValidation
source: Write a bit more about the recipe
pt_br: Escreva um pouco mais sobre a receita

# recipeWriteAtLeast50Chars
source: Write at least 50 characters to proceed.
pt_br: Escreva no minimo 50 caracteres para avançar.

# recipeWriteInstructionsPlaceholder
source: Write the preparation instructions...
pt_br: Escreva as instruções de preparo...

# recipeSelectIngredientsTitle
source: Select ingredients
pt_br: Selecionar ingredientes

# recipeSearchIngredientsHint
source: Search your ingredients
pt_br: Pesquise seus ingredientes

# recipeChooseOtherIngredients
source: Choose other ingredients below
pt_br: Escolha outros ingredientes abaixo

# recipeFinish
source: Finish
pt_br: Finalizar

# recipeServeTimeTitle
source: Time to serve!
pt_br: Hora de se servir!

# recipeFinalConsideration
source: Write a final consideration giving some tip or useful information for those who are completing or will complete the recipe.
pt_br: Escreva um consideração final dando alguma dica ou informação útil para quem estiver concluindo ou concluir a receita.

# recipeServeDetailsPlaceholder
source: Write in detail how to serve the dish...
pt_br: Escreva em detalhes como servir o prato...

# searchRecipeSearchHint
source: Search for something to cook
pt_br: Procure algo para cozinhar

# searchRecipeClearFilters
source: Clear filters
pt_br: Limpar filtros

# searchRecipeSearchResults
source: Search results
pt_br: Resultados da pesquisa

# searchRecipeApplyFilter
source: Apply filter
pt_br: Aplicar filtro

# searchRecipeFilterBy
source: FILTER BY
pt_br: FILTRAR POR

# searchRecipeOrderBy
source: Order by
pt_br: Ordernar por

# searchRecipePreparationTime
source: Preparation time
pt_br: Tempo de preparo

# searchRecipeIngredients
source: Ingredients
pt_br: Ingredientes

# searchRecipePortions
source: Servings
pt_br: Porções

# searchRecipeFoodPreference
source: Food preference
pt_br: Preferência alimentar

# searchRecipeDifficulty
source: Difficulty
pt_br: Dificuldade

# searchRecipeOrderByAsc
source: From A - Z
pt_br: De A - Z

# searchRecipeOrderByDesc
source: From Z - A
pt_br: De Z - A

# searchRecipeOrderDifficultyEasy
source: Easy
pt_br: Fácil

# searchRecipeOrderDifficultyMedium
source: Medium
pt_br: Médio

# searchRecipeOrderDifficultyHard
source: Hard
pt_br: Difícil

# searchLabel
source: Search
pt_br: Pesquisa

# splashLoading
source: Loading...
pt_br: Carregando...
